{
  "intents": [
    {
      "tag": "no_data",
      "patterns": [
        "a",
        "b",
        "c",
        "d",
        "e",
        "f",
        "g",
        "h",
        "i",
        "j",
        "k",
        "l",
        "m",
        "n",
        "o",
        "p",
        "q",
        "r",
        "s",
        "t",
        "u",
        "v",
        "w",
        "x",
        "y",
        "z",
        "1",
        "2",
        "3",
        "4",
        "5",
        "6",
        "7",
        "8",
        "9",
        ",",
        "%",
        "#",
        "@",
        "*",
        "&",
        "+",
        "-",
        "=",
        "/",
        "!",
        "?",
        ":",
        ";",
        "<",
        ">",
        "(",
        ")",
        "{",
        "}",
        "[",
        "]",
        "$",
        "€",
        "¥",
        "£",
        "₹",
        "₽",
        "§"
      ],
      "responses": [
        "Maaf, saya belum mengerti maksud Anda. Bisa coba dijelaskan lagi?",
        "Hmm, saya belum punya informasi tentang itu. Ada yang lain yang bisa saya bantu?"
      ]
    },
    {
      "tag": "greeting",
      "patterns": ["Halo", "Hai", "Pagi", "Siang", "Malam", "Hey", "Hi", "hallo"],
      "responses": [
        "Halo! Ada yang bisa saya bantu?",
        "Hai, selamat datang di RUDI SALON & SPA! Ada yang bisa saya bantu?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "Dah", "Selamat tinggal", "Sampai jumpa"],
      "responses": [
        "Sampai jumpa lagi, semoga harimu menyenangkan!",
        "Bye! Jangan lupa kembali lagi ya."
      ]
    },
    {
      "tag": "terimakasih",
      "patterns": ["Terima kasih", "Thanks", "Makasih", "terimakasih"],
      "responses": [
        "Sama-sama! Senang bisa membantu.",
        "Terima kasih kembali. Ada lagi yang bisa saya bantu?"
      ]
    },
    {
      "tag": "salam",
      "patterns": ["Assalamualaikum"],
      "responses": [
        "Waalaikumsalam, ada yang bisa saya bantu di RUDI SALON & SPA?",
        "Waalaikumsalam, silakan ajukan pertanyaan Anda!"
      ]
    },
    {
      "tag": "layanan",
      "patterns": [
        "layanan",
        "Apa saja layanan di sini?",
        "Layanan apa yang tersedia?",
        "Jenis perawatan apa yang ada?",
        "Layanan apa yang ditawarkan Rudy Salon?",
        "Apa saja treatment yang bisa dilakukan di sini?",
        "Perawatan apa saja yang tersedia di Rudy Salon?"
      ],
      "responses": [
        "Kami menawarkan potong rambut, coloring, facial, spa, dan body treatment. Ada yang ingin dicoba?",
        "Layanan kami meliputi perawatan rambut, wajah, tubuh, dan spa relaksasi. Tertarik mencoba yang mana?",
        "Di Rudy Salon, Anda bisa menikmati potong rambut, pewarnaan, facial, spa relaksasi, serta perawatan tubuh lainnya.",
        "Kami menyediakan berbagai layanan mulai dari potong rambut, coloring, facial, body treatment, hingga spa untuk relaksasi.",
        "Layanan yang kami tawarkan mencakup perawatan rambut, facial, spa, body treatment, serta layanan lainnya untuk menjaga kecantikan Anda.",
        "Rudy Salon menawarkan layanan potong rambut, pewarnaan, facial, spa, dan berbagai treatment untuk kulit dan tubuh.",
        "Kami memiliki berbagai layanan perawatan mulai dari potong rambut, coloring, facial, body treatment, hingga spa untuk relaksasi."
      ]
    },
    {
      "tag": "harga",
      "patterns": [
        "harga",
        "Berapa harga facial?",
        "Harga layanan berapa?",
        "Berapa biaya perawatan?"
      ],
      "responses": [
        "Layanan kami mulai dari Rp100.000 hingga Rp500.000. Ingin tahu lebih lanjut?"
      ]
    },
    {
      "tag": "jadwal",
      "patterns": [
        "jadwal",
        "Jam buka salon?",
        "Salon buka sampai jam berapa?",
        "Jam operasional Rudy Salon?",
        "Kapan Rudy Salon buka?"
      ],
      "responses": [
        "Kami buka setiap hari dari jam 09:00 hingga 19:00.",
        "Jam operasional kami adalah 09:00 - 19:00. Silakan datang kapan saja dalam jam tersebut!",
        "Rudy Salon buka setiap hari mulai jam 09:00 hingga 19:00.",
        "Kami melayani Anda setiap hari dari pukul 09:00 sampai 19:00. Silakan datang ke salon kami."
      ]
    },
    {
      "tag": "kontak",
      "patterns": [
        "kontak",
        "Bagaimana cara menghubungi?",
        "Nomor kontak salon?",
        "Apa nomor yang bisa dihubungi?",
        "Bagaimana cara saya bisa menghubungi Rudy Salon?",
        "Ada nomor yang bisa dihubungi?",
        "Nomor telepon Rudy Salon?",
        "Kontak untuk reservasi?",
        "Saya ingin menghubungi Rudy Salon, bagaimana caranya?"
      ],
      "responses": [
        "Anda bisa hubungi kami di +6281399891248. Kami siap membantu!",
        "Kontak kami: +6281399891248. Silakan hubungi untuk pertanyaan lebih lanjut.",
        "Untuk informasi lebih lanjut, hubungi kami di +6281399891248. Kami siap melayani Anda.",
        "Jika ada pertanyaan atau untuk reservasi, silakan hubungi kami di +6281399891248.",
        "Hubungi kami di +6281399891248 untuk informasi lebih lanjut dan pemesanan.",
        "Nomor kontak Rudy Salon adalah +6281399891248. Jangan ragu untuk menghubungi kami kapan saja!",
        "Untuk konsultasi atau pemesanan, Anda bisa menghubungi kami di +6281399891248.",
        "Anda dapat menghubungi kami melalui nomor telepon +6281399891248 untuk pertanyaan atau informasi lebih lanjut."
      ]
    },
    {
      "tag": "reservasi",
      "patterns": [
        "reservasi",
        "Bagaimana cara reservasi?",
        "Bisa booking perawatan?",
        "Apa cara untuk melakukan reservasi?",
        "Saya ingin membuat reservasi, bagaimana caranya?",
        "Bagaimana cara melakukan booking untuk perawatan?",
        "Apakah saya bisa reservasi layanan?",
        "Bagaimana cara pesan perawatan di Rudy Salon?"
      ],
      "responses": [
        "Tentu saja! Beri tahu kami jenis layanan dan waktu yang diinginkan.",
        "Silakan sebutkan perawatan yang ingin Anda pesan dan jadwalnya. Kami akan mengatur untuk Anda.",
        "Untuk reservasi, cukup sebutkan layanan yang Anda inginkan dan waktu yang tersedia. Kami siap membantu!",
        "Anda dapat melakukan reservasi dengan menyebutkan jenis layanan dan waktu yang Anda inginkan. Kami akan mengonfirmasi jadwalnya.",
        "Untuk memesan layanan, beri tahu kami jenis perawatan dan waktu yang Anda inginkan. Kami akan segera mengatur jadwalnya.",
        "Reservasi sangat mudah! Cukup informasikan layanan yang diinginkan dan jadwal yang sesuai, dan kami akan menyiapkan semuanya.",
        "Ingin melakukan reservasi? Sebutkan layanan dan waktu yang Anda pilih, kami akan menyesuaikan jadwal untuk Anda.",
        "Anda bisa melakukan reservasi dengan menginformasikan jenis perawatan dan waktu yang diinginkan. Kami akan segera mengonfirmasi reservasi Anda."
      ]
    },
    {
      "tag": "promo",
      "patterns": [
        "promo",
        "diskon",
        "Ada promo saat ini?",
        "Diskon apa yang tersedia?",
        "Apa ada penawaran khusus?",
        "Promo spesial apa yang sedang berlangsung?",
        "Ada diskon bulan ini?",
        "Apakah adadisk potongan harga sekarang?",
        "Ada promo menarik di Rudy Salon & Spa?"
      ],
      "responses": [
        "Kami punya promo potongan harga hingga 30% untuk perawatan rambut dan facial. Tertarik mencoba? Untuk informasi lebih lanjut, kunjungi: (https://www.rudyhadisuwarno.id/promo)",
        "Promo spesial bulan ini: Diskon 20% untuk perawatan wajah dan rambut. Jangan lewatkan! Lihat detail lebih lanjut di: (https://www.rudyhadisuwarno.id/promo)",
        "Dapatkan diskon 25% untuk perawatan rambut dan wajah saat kamu booking minggu ini! Cek lebih lanjut di: (https://www.rudyhadisuwarno.id/promo)",
        "Ada promo khusus untuk pelanggan baru, potongan harga 15% untuk semua layanan. Yuk coba! Informasi lebih lanjut ada di: (https://www.rudyhadisuwarno.id/promo)",
        "Nikmati diskon 10% untuk paket perawatan rambut dan tubuh. Cek jadwalnya sekarang! Lihat promo lainnya di: (https://www.rudyhadisuwarno.id/promo)",
        "Untuk bulan ini, dapatkan voucher diskon 30% untuk perawatan wajah dan rambut. Tunggu apa lagi? Cek detailnya di: (https://www.rudyhadisuwarno.id/promo)",
        "Spesial bulan ini, diskon 20% untuk semua perawatan kecantikan! Buruan sebelum kehabisan! Kunjungi kami untuk info lebih lanjut di: (https://www.rudyhadisuwarno.id/promo)",
        "Untuk informasi lebih lanjut tentang promo kami, kunjungi: (https://www.rudyhadisuwarno.id/promo)"
      ]
    },
    {
      "tag": "karyawan",
      "patterns": [
        "karyawan",
        "Berapa banyak staf di sini?",
        "Ada berapa stylist di salon ini?",
        "Berapa banyak karyawan yang bekerja di Rudy Salon?",
        "Ada berapa orang di tim Rudy Salon?",
        "Berapa banyak stylist yang melayani di salon ini?",
        "Tim Rudy Salon terdiri dari berapa orang?",
        "Berapa jumlah staf yang bekerja di salon Rudy?"
      ],
      "responses": [
        "Kami memiliki 10 stylist profesional yang siap melayani Anda.",
        "Tim kami terdiri dari 15 orang, termasuk stylist, terapis, dan resepsionis yang ramah.",
        "Salon kami memiliki lebih dari 12 stylist yang berpengalaman untuk memberikan layanan terbaik.",
        "Kami memiliki 20 staf yang terdiri dari stylist, terapis, dan tim pendukung lainnya.",
        "Di Rudy Salon, kami memiliki 18 staf yang terdiri dari stylist handal dan terapis berpengalaman.",
        "Tim kami terdiri dari 12 orang, termasuk stylist, terapis, dan resepsionis yang siap membantu kebutuhan Anda.",
        "Terdapat 15 stylist profesional yang siap memberikan perawatan terbaik untuk Anda.",
        "Di salon ini, ada 14 stylist dan beberapa staf pendukung untuk memastikan layanan terbaik."
      ]
    },
    {
      "tag": "lokasi",
      "patterns": [
        "dimana",
        "di mana",
        "lokasi",
        "alamat",
        "Di mana alamat Rudy Salon & Spa?",
        "Bisa kasih tahu lokasi salon ini?",
        "Rudy Salon & Spa ada di mana ya?",
        "Alamat lengkap Rudy Salon & Spa?",
        "Lokasi Rudy Salon & Spa itu di mana?",
        "Salon Rudy itu ada di daerah mana?",
        "Di mana tempat Rudy Salon & Spa?",
        "Tempat salon Rudy itu di mana?",
        "Dimana lokasi tempat Rudy Salon & Spa?",
        "Bisa berikan alamat lengkap Rudy Salon & Spa?"
      ],
      "responses": [
        "Rudy Salon & Spa berlokasi di Jalan Boulevard Hijau Raya No. 56 Blok A3 RT 06/RW09, Pejuang, Kecamatan Medan Satria, Bekasi Regency, Jawa Barat. Silakan kunjungi, kami tunggu kehadiran Anda!"
      ]
    },
    {
      "tag": "produk",
      "patterns": [
        "produk",
        "Apa saja produk yang dijual di Rudy Salon?",
        "Produk apa yang tersedia di salon ini?",
        "Ada produk kecantikan apa yang dijual di Rudy Salon?",
        "Apa saja produk perawatan yang bisa dibeli di Rudy Salon?",
        "Produk perawatan apa yang tersedia di Rudy Salon?",
        "Apa saja produk kecantikan yang dijual di salon ini?"
      ],
      "responses": [
        "Kami menjual berbagai produk perawatan rambut, wajah, dan tubuh dari merek terkemuka. Anda bisa mendapatkan produk-produk berkualitas di Rudy Salon.",
        "Di Rudy Salon, Anda bisa menemukan produk perawatan rambut, wajah, dan tubuh dari merek terpercaya. Kunjungi kami untuk mendapatkan produk kecantikan terbaik!"
      ]
    },
    {
      "tag": "metode_pembayaran",
      "patterns": [
        "metode pembayaran",
        "pembayaran",
        "Apa saja metode pembayaran yang diterima?",
        "Bisa bayar pakai kartu?",
        "Metode pembayaran apa saja yang diterima di Rudy Salon?",
        "Apa saja cara pembayaran di salon ini?",
        "Bisa bayar pakai e-wallet?",
        "Pembayaran diterima dengan cara apa saja?",
        "Metode pembayaran apa yang tersedia di Rudy Salon?",
        "metode pembayaran apa yang bisa digunakan?"
      ],
      "responses": [
        "Kami menerima pembayaran tunai, kartu debit/kredit, dan e-wallet seperti OVO dan GoPay.",
        "Pembayaran bisa dilakukan dengan tunai, kartu, atau e-wallet. Silakan pilih yang nyaman untuk Anda!",
        "Di Rudy Salon, kami menerima pembayaran menggunakan tunai, kartu kredit/debit, serta e-wallet seperti OVO dan GoPay.",
        "Anda dapat membayar dengan tunai, kartu debit atau kredit, atau menggunakan e-wallet seperti OVO, GoPay, dan lainnya.",
        "Kami menerima berbagai metode pembayaran, termasuk tunai, kartu, dan e-wallet seperti OVO dan GoPay.",
        "Metode pembayaran yang kami terima adalah tunai, kartu kredit/debit, dan e-wallet seperti OVO, GoPay, serta lainnya.",
        "Untuk kenyamanan Anda, kami menerima pembayaran dengan tunai, kartu, serta e-wallet seperti OVO dan GoPay."
      ]
    },
    {
      "tag": "keluhan",
      "patterns": [
        "tidak puas",
        "saya tidak puas",
        "Saya tidak puas dengan layanan",
        "Bagaimana cara komplain?",
        "Saya ingin menyampaikan keluhan",
        "Layanan di sini kurang memuaskan",
        "Ada keluhan tentang layanan yang saya terima",
        "Saya ingin memberikan masukan terkait layanan",
        "Bagaimana cara mengajukan keluhan di Rudy Salon?"
      ],
      "responses": [
        "Kami mohon maaf atas ketidaknyamanannya. Anda bisa sampaikan keluhan Anda di nomor 6281399891248.",
        "Kami menghargai masukan Anda. Silakan hubungi kami melalui nomor kontak atau email untuk menyampaikan keluhan.",
        "Kami sangat menghargai feedback Anda. Untuk keluhan, Anda dapat menghubungi kami di nomor 6281399891248 atau melalui email kami.",
        "Kami minta maaf jika layanan kami tidak memenuhi harapan Anda. Silakan hubungi kami di nomor 6281399891248 untuk mengajukan keluhan atau memberikan saran.",
        "Jika ada ketidakpuasan dengan layanan, kami siap mendengarkan dan membantu. Hubungi kami di nomor 6281399891248 untuk keluhan lebih lanjut.",
        "Kami ingin memastikan kepuasan Anda. Untuk keluhan, Anda dapat menghubungi kami di nomor 6281399891248 atau melalui email kami.",
        "Kami sangat menghargai feedback yang membangun. Jika Anda memiliki keluhan, silakan hubungi kami di nomor 6281399891248."
      ]
    },
    {
      "tag": "spa_rekomendasi",
      "patterns": [
        "rekomendasi",
        "Rekomendasi spa terbaik?",
        "Spa yang cocok untuk relaksasi?",
        "Apa paket spa terbaik untuk relaksasi?",
        "Spa untuk relaksasi apa yang bisa dicoba?",
        "Apa spa yang paling cocok untuk melepaskan stres?",
        "Paket spa apa yang disarankan untuk relaksasi?"
      ],
      "responses": [
        "Kami merekomendasikan paket spa Aromatherapy untuk relaksasi terbaik. Harganya Rp300.000 per sesi.",
        "Paket spa Aromatherapy sangat cocok untuk relaksasi, dengan harga Rp300.000 per sesi.",
        "Cobalah paket Body Spa + Aromatherapy untuk pengalaman relaksasi yang luar biasa. Harga Rp350.000 per sesi.",
        "Untuk meredakan stres, kami menyarankan paket Relaxation Spa yang mencakup pijat aromaterapi. Harga Rp250.000 per sesi.",
        "Paket spa terbaik untuk Anda adalah Aromatherapy atau Body Spa, keduanya efektif untuk relaksasi maksimal.",
        "Jika Anda mencari relaksasi, coba paket Body Spa + Aromatherapy, yang akan membuat Anda merasa lebih segar dan tenang."
      ]
    }
  ]
}
